package com.zjs.youxi.Tools;

import java.util.List;

public class Joke_Data {

    /**
     * status : 0
     * msg : ok
     * result : {"total":79631,"pagenum":1,"pagesize":20,"list":[{"content":"520警告： 520这天许多地区电闪雷鸣，主要是这一天撒谎的人太多，遭到了雷劈，如果你所在的地区是这样，你就要多加小心了！","addtime":"2020-05-23 03:20:03","url":"http://m.kaixinhui.com/detail-128413.html"},{"content":"王自健在节目中调侃，对于老婆打自己这件事没有任何不满，没有任何抱怨。 这反映了一个问题，在中国： 老婆就是用来爱的， 老公就是用来打的。 中国妇女的地位真的提高了，可喜可贺！","addtime":"2020-03-28 03:20:02","url":"http://m.kaixinhui.com/detail-128412.html"},{"content":"保安三问：你是谁，从哪来，要去哪？ 食堂三问：要哪个，要多少，要不要？ 自习三问：有人吗，会做吗，懂了吗？ 情变三问：你是谁，他是谁，我是谁？ 领 导三问：怎么想，怎么干，怎么办？ 晚饭三问：吃什么，和谁吃，去哪吃？","addtime":"2020-03-20 03:20:19","url":"http://m.kaixinhui.com/detail-128411.html"},{"content":"母亲节那天， 在店里给妈妈买了双300块的鞋子， 怕她老人家心疼钱， 故意说才60块， 然后妈妈告诉几个 一块跳广场舞的老姐妹， 几个阿姨结伴跑去那家店铺买， 店家开口就要300多一双， 老妈跟店老板理论： 我闺女昨天刚买的60， 你这是坐地涨价啊， 然后几轮讨价还价下来，60块五个阿姨一人拎着一双鞋回来了...","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128410.html"},{"content":"参加好哥们的婚礼，特意准备了一个大红包，结果因为专注的玩手机，红包忘给了，我永远忘不了，哥们送我走的时候，紧紧握着我的手，恋恋不舍，一副欲言又止的激动样子！","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128409.html"},{"content":"纹身不纹嗜血狼，独狼带血家必亡。纹身不纹下山虎，猛虎下山反噬主。纹身不纹睁眼关，睁眼关公杀人间。纹身不纹唐三藏，九九八一难相抗。纹身不纹小哪吒，龙遇哪吒命丧涯。纹身不纹老钟馗，避鬼不成反招贼。人生在世苦难短，无论纹啥别开眼。要纹就纹葫芦娃，蛇精波大嫩又滑。要纹就纹皮皮虾，假装蝎子顺臂爬。要纹就纹哈士奇，貌如二货小帅狼。要纹就纹武二郎，能防家中藏老王。","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128408.html"},{"content":"想起一个古老笑话...... 有一闪电侠经过路边，看到女超人躺在巷子里头自我安慰。他二话不说衝上去啪完走人。 隔天在总部，闪电侠看到透明人大衣，一拐一拐的走进来。他就问，\u201c咋啦？扭到脚了？\u201d 透明人说：\u201c昨天跟女超人在巷子里啪啪，不知道哪个混蛋从我后面捅了几下，害我痔疮破了！\u201d","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128407.html"},{"content":"昨天脑子进了点水,今天降温,脑袋被冻住了,怎么也找不到自行车钥匙。找来找去，最后发现钥匙就在钥匙孔上，昨天回来忘拔了。你们那里降温了吗？","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128404.html"},{"content":"床底下都没地方了。 10卷卷纸5提、30包纸抽2箱、12包手帕纸4提、10片独立湿巾6包、80片湿巾6包、1.5kg洗洁精8瓶、3kg洗衣液6瓶、400g手洗洗衣液4瓶、4L除菌液3瓶、210g牙膏8盒。","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128402.html"},{"content":"养了两只猫，有一天一只猫在打哈欠，我就把她自己的尾巴塞进了她的嘴里，结果那只打哈欠的猫反应是若有所思的咀嚼几下，然后暴走，去打另一只猫。","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128398.html"},{"content":"为什么猫不让摸肚子，猫有八个乳房，你以为你在摸肚子，其实是在摸胸部。手一伸上来直奔敏感部位，不咬你咬谁，得先做前戏啊","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128397.html"},{"content":"甲：这世上最生僻的字是哪一个？ 乙：不知道，你说。 甲：是\u201c豆\u201d 乙：为啥？ 甲：你吃一次就明白了","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128396.html"},{"content":" 【幽默笑话】今天从抽屉里找东西，然后扒拉出了十几种各式各样的证件。从我那价值20元的身份证到几十万元的房产证望着这一堆证件我陷入了沉思：原来我才是家里最不值钱的\u2014\u201420元。满腹牢骚无处发泄时，鄙人看到了价值9元的结婚证。 【幽默笑话】闺蜜怀孕七个月就生了，我去医院看望她时，她忧心忡忡地对我说：\u201c听说早产儿不容易养大啊！\u201d我宽慰道：\u201c放心吧，没事的，我妈当年生我的时候也是早产！\u201d我还没说完闺蜜就抢着问道：\u201c那养大了没？\u201d 【幽默笑话】哥哥家养了一只可爱的猫咪，今天突然听说打算把它送人了，有些不解，问其原因。原来是七个月大的侄儿还没学会说话，竟然学起了猫叫\u2026\u2026 【幽默笑话】刚下车把车门锁住了，钥匙也落车里，车内三岁的侄女还在睡觉。我用力拍车窗把侄女叫醒，对她大喊：\u201c你在里面等着我，我回家拿备用钥匙，等着我啊！\u201d只见侄女缓缓摇下车窗：\u201c你说啥？\u201d我\u2026\u2026 【幽默笑话】高中时，我正是热血洋溢 的年纪，有一次我在看日本电影，里面说学生成绩不是很好，老师都会到家里补课。因此，我也就不怎么认真学习了，以至于我的学习成绩就直线下滑了，结果没有一个老师单独留下来给我补习过功课。我现在想一想，当初的我是多么幼稚\u2026\u2026果然，童话里都是骗人的。 【幽默笑话】昨天姐夫叫我们一家人全部上他家吃饭，姐夫说我姐杀了一只羊，我说：怪哉怪哉！我姐连鱼都不敢杀，现在居然敢杀羊了？姐夫说：这不前几天刚拿到了驾驶证嘛，工具改进了，回家的路上用新车杀的！ (展开全部) ","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128395.html"},{"content":"我跟我女朋友睡在一起，有个男的掀我被子,然后还打了我几下，也插了我女朋友几下，然后那个男的就让我们继续睡了，让我感到十分困惑，","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128394.html"},{"content":"同事抱怨这天气还有蚊子叮他，我说要不吃点避孕药，这样蚊子就算叮了你，卵也不能孵化了，可以从根源上给蚊子断后。他想了想，好像是这么回事，就是怕连空气都绝后了","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128392.html"},{"content":"小时候课堂上同学们说长大了要当科学家、画家、作家，现在长大了我tm只想宅在家。","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128389.html"},{"content":"长大（可能是老）了，春梦也不做了，也不梦遗了\u2026\u2026你们是这样的吗？","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128387.html"},{"content":" 今天接了房产中介的电话， 房产中介问我：买不买房子？再不买，2020年底放开调控，房价又要涨。 我说：已经有几套了，没有钱也没有购房资格，不想买了！ 房产中介停顿了一下：那你的房子卖吗？ 房产税今年可能要出台了，现在房价这么高，恐怕到时候会跌很多。 我感觉不说实话就不行了，就对他说：我其实没有房，也没钱买房，现在待业。 房产中介沉默片刻：明天有个楼开盘，白天排队100，晚上自带凳子排队150，包盒饭矿泉水，另外拉一个朋友来看盘，单独奖励20，来吗？ 我说：天太冷，排队时间又长，不想来。 房产中介：周末还有一个楼盘开发商找群演，抗议开发商降价，闹\"退房\"，年龄要求30-50岁，男女皆可，需要推搡保安，砸售楼部摔杯子，不用赔钱，需要有演技，有状态，情绪要亢奋，300一上午，要来吗？ 我说：感冒了，医生让卧床休息，不想动。 房产中介：那能玩手机吗？在贴吧发一个你在某新楼盘刚买了新房，评价下质量好 ，回复一层楼10元 (展开全部) ","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128385.html"},{"content":"一个老板说：谁要敢跳进鳄鱼池并活着上岸，奖励100万。死了给500万。 大家都没人敢跳。 忽然\u201c扑通\u201d一声，一个人跳入池中。只见他被鳄鱼追赶着游得飞快，脸色苍白，拼了命地游上了对岸，接过100万后，他怒火冲天：是谁把老子推下去的？他老婆笑着说：是我。 所以后来就有了那句\u201c每个成功的男人背后，都有一个优秀的女人\u201d。 关键时刻，能推你一把","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128384.html"},{"content":"我：\u201c我要十三薪。\u201d 老板：\u201c没问题。\u201d 我：\u201c我要有年假。\u201d 老板：\u201c没问题。\u201d 我：\u201c我要不加班。\u201d 老板：\u201c你广告看多了吧？不加班是不可能的。不加班你哪来的十三薪？不加班你哪来的年假？不加班我们凭什么录用你？\u201d","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128381.html"}]}
     */

    private int status;
    private String msg;
    private ResultBean result;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * total : 79631
         * pagenum : 1
         * pagesize : 20
         * list : [{"content":"520警告： 520这天许多地区电闪雷鸣，主要是这一天撒谎的人太多，遭到了雷劈，如果你所在的地区是这样，你就要多加小心了！","addtime":"2020-05-23 03:20:03","url":"http://m.kaixinhui.com/detail-128413.html"},{"content":"王自健在节目中调侃，对于老婆打自己这件事没有任何不满，没有任何抱怨。 这反映了一个问题，在中国： 老婆就是用来爱的， 老公就是用来打的。 中国妇女的地位真的提高了，可喜可贺！","addtime":"2020-03-28 03:20:02","url":"http://m.kaixinhui.com/detail-128412.html"},{"content":"保安三问：你是谁，从哪来，要去哪？ 食堂三问：要哪个，要多少，要不要？ 自习三问：有人吗，会做吗，懂了吗？ 情变三问：你是谁，他是谁，我是谁？ 领 导三问：怎么想，怎么干，怎么办？ 晚饭三问：吃什么，和谁吃，去哪吃？","addtime":"2020-03-20 03:20:19","url":"http://m.kaixinhui.com/detail-128411.html"},{"content":"母亲节那天， 在店里给妈妈买了双300块的鞋子， 怕她老人家心疼钱， 故意说才60块， 然后妈妈告诉几个 一块跳广场舞的老姐妹， 几个阿姨结伴跑去那家店铺买， 店家开口就要300多一双， 老妈跟店老板理论： 我闺女昨天刚买的60， 你这是坐地涨价啊， 然后几轮讨价还价下来，60块五个阿姨一人拎着一双鞋回来了...","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128410.html"},{"content":"参加好哥们的婚礼，特意准备了一个大红包，结果因为专注的玩手机，红包忘给了，我永远忘不了，哥们送我走的时候，紧紧握着我的手，恋恋不舍，一副欲言又止的激动样子！","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128409.html"},{"content":"纹身不纹嗜血狼，独狼带血家必亡。纹身不纹下山虎，猛虎下山反噬主。纹身不纹睁眼关，睁眼关公杀人间。纹身不纹唐三藏，九九八一难相抗。纹身不纹小哪吒，龙遇哪吒命丧涯。纹身不纹老钟馗，避鬼不成反招贼。人生在世苦难短，无论纹啥别开眼。要纹就纹葫芦娃，蛇精波大嫩又滑。要纹就纹皮皮虾，假装蝎子顺臂爬。要纹就纹哈士奇，貌如二货小帅狼。要纹就纹武二郎，能防家中藏老王。","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128408.html"},{"content":"想起一个古老笑话...... 有一闪电侠经过路边，看到女超人躺在巷子里头自我安慰。他二话不说衝上去啪完走人。 隔天在总部，闪电侠看到透明人大衣，一拐一拐的走进来。他就问，\u201c咋啦？扭到脚了？\u201d 透明人说：\u201c昨天跟女超人在巷子里啪啪，不知道哪个混蛋从我后面捅了几下，害我痔疮破了！\u201d","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128407.html"},{"content":"昨天脑子进了点水,今天降温,脑袋被冻住了,怎么也找不到自行车钥匙。找来找去，最后发现钥匙就在钥匙孔上，昨天回来忘拔了。你们那里降温了吗？","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128404.html"},{"content":"床底下都没地方了。 10卷卷纸5提、30包纸抽2箱、12包手帕纸4提、10片独立湿巾6包、80片湿巾6包、1.5kg洗洁精8瓶、3kg洗衣液6瓶、400g手洗洗衣液4瓶、4L除菌液3瓶、210g牙膏8盒。","addtime":"2020-03-20 03:20:18","url":"http://m.kaixinhui.com/detail-128402.html"},{"content":"养了两只猫，有一天一只猫在打哈欠，我就把她自己的尾巴塞进了她的嘴里，结果那只打哈欠的猫反应是若有所思的咀嚼几下，然后暴走，去打另一只猫。","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128398.html"},{"content":"为什么猫不让摸肚子，猫有八个乳房，你以为你在摸肚子，其实是在摸胸部。手一伸上来直奔敏感部位，不咬你咬谁，得先做前戏啊","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128397.html"},{"content":"甲：这世上最生僻的字是哪一个？ 乙：不知道，你说。 甲：是\u201c豆\u201d 乙：为啥？ 甲：你吃一次就明白了","addtime":"2020-03-20 03:20:17","url":"http://m.kaixinhui.com/detail-128396.html"},{"content":" 【幽默笑话】今天从抽屉里找东西，然后扒拉出了十几种各式各样的证件。从我那价值20元的身份证到几十万元的房产证望着这一堆证件我陷入了沉思：原来我才是家里最不值钱的\u2014\u201420元。满腹牢骚无处发泄时，鄙人看到了价值9元的结婚证。 【幽默笑话】闺蜜怀孕七个月就生了，我去医院看望她时，她忧心忡忡地对我说：\u201c听说早产儿不容易养大啊！\u201d我宽慰道：\u201c放心吧，没事的，我妈当年生我的时候也是早产！\u201d我还没说完闺蜜就抢着问道：\u201c那养大了没？\u201d 【幽默笑话】哥哥家养了一只可爱的猫咪，今天突然听说打算把它送人了，有些不解，问其原因。原来是七个月大的侄儿还没学会说话，竟然学起了猫叫\u2026\u2026 【幽默笑话】刚下车把车门锁住了，钥匙也落车里，车内三岁的侄女还在睡觉。我用力拍车窗把侄女叫醒，对她大喊：\u201c你在里面等着我，我回家拿备用钥匙，等着我啊！\u201d只见侄女缓缓摇下车窗：\u201c你说啥？\u201d我\u2026\u2026 【幽默笑话】高中时，我正是热血洋溢 的年纪，有一次我在看日本电影，里面说学生成绩不是很好，老师都会到家里补课。因此，我也就不怎么认真学习了，以至于我的学习成绩就直线下滑了，结果没有一个老师单独留下来给我补习过功课。我现在想一想，当初的我是多么幼稚\u2026\u2026果然，童话里都是骗人的。 【幽默笑话】昨天姐夫叫我们一家人全部上他家吃饭，姐夫说我姐杀了一只羊，我说：怪哉怪哉！我姐连鱼都不敢杀，现在居然敢杀羊了？姐夫说：这不前几天刚拿到了驾驶证嘛，工具改进了，回家的路上用新车杀的！ (展开全部) ","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128395.html"},{"content":"我跟我女朋友睡在一起，有个男的掀我被子,然后还打了我几下，也插了我女朋友几下，然后那个男的就让我们继续睡了，让我感到十分困惑，","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128394.html"},{"content":"同事抱怨这天气还有蚊子叮他，我说要不吃点避孕药，这样蚊子就算叮了你，卵也不能孵化了，可以从根源上给蚊子断后。他想了想，好像是这么回事，就是怕连空气都绝后了","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128392.html"},{"content":"小时候课堂上同学们说长大了要当科学家、画家、作家，现在长大了我tm只想宅在家。","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128389.html"},{"content":"长大（可能是老）了，春梦也不做了，也不梦遗了\u2026\u2026你们是这样的吗？","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128387.html"},{"content":" 今天接了房产中介的电话， 房产中介问我：买不买房子？再不买，2020年底放开调控，房价又要涨。 我说：已经有几套了，没有钱也没有购房资格，不想买了！ 房产中介停顿了一下：那你的房子卖吗？ 房产税今年可能要出台了，现在房价这么高，恐怕到时候会跌很多。 我感觉不说实话就不行了，就对他说：我其实没有房，也没钱买房，现在待业。 房产中介沉默片刻：明天有个楼开盘，白天排队100，晚上自带凳子排队150，包盒饭矿泉水，另外拉一个朋友来看盘，单独奖励20，来吗？ 我说：天太冷，排队时间又长，不想来。 房产中介：周末还有一个楼盘开发商找群演，抗议开发商降价，闹\"退房\"，年龄要求30-50岁，男女皆可，需要推搡保安，砸售楼部摔杯子，不用赔钱，需要有演技，有状态，情绪要亢奋，300一上午，要来吗？ 我说：感冒了，医生让卧床休息，不想动。 房产中介：那能玩手机吗？在贴吧发一个你在某新楼盘刚买了新房，评价下质量好 ，回复一层楼10元 (展开全部) ","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128385.html"},{"content":"一个老板说：谁要敢跳进鳄鱼池并活着上岸，奖励100万。死了给500万。 大家都没人敢跳。 忽然\u201c扑通\u201d一声，一个人跳入池中。只见他被鳄鱼追赶着游得飞快，脸色苍白，拼了命地游上了对岸，接过100万后，他怒火冲天：是谁把老子推下去的？他老婆笑着说：是我。 所以后来就有了那句\u201c每个成功的男人背后，都有一个优秀的女人\u201d。 关键时刻，能推你一把","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128384.html"},{"content":"我：\u201c我要十三薪。\u201d 老板：\u201c没问题。\u201d 我：\u201c我要有年假。\u201d 老板：\u201c没问题。\u201d 我：\u201c我要不加班。\u201d 老板：\u201c你广告看多了吧？不加班是不可能的。不加班你哪来的十三薪？不加班你哪来的年假？不加班我们凭什么录用你？\u201d","addtime":"2020-03-20 03:20:16","url":"http://m.kaixinhui.com/detail-128381.html"}]
         */

        private int total;
        private int pagenum;
        private int pagesize;
        private List<ListBean> list;

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public int getPagenum() {
            return pagenum;
        }

        public void setPagenum(int pagenum) {
            this.pagenum = pagenum;
        }

        public int getPagesize() {
            return pagesize;
        }

        public void setPagesize(int pagesize) {
            this.pagesize = pagesize;
        }

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean {
            /**
             * content : 520警告： 520这天许多地区电闪雷鸣，主要是这一天撒谎的人太多，遭到了雷劈，如果你所在的地区是这样，你就要多加小心了！
             * addtime : 2020-05-23 03:20:03
             * url : http://m.kaixinhui.com/detail-128413.html
             */

            private String content;
            private String addtime;
            private String url;

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getAddtime() {
                return addtime;
            }

            public void setAddtime(String addtime) {
                this.addtime = addtime;
            }

            public String getUrl() {
                return url;
            }

            public void setUrl(String url) {
                this.url = url;
            }
        }
    }
}
